Revit 2024 API
AssetPropertyFloatArray.GetValue Method
Get the value of the property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<float> GetValue()
Visual Basic
Public Function GetValue As IList(Of Single)
Visual C++
public:
IList<float>^ GetValue()
See Also
AssetPropertyFloatArray Class
Autodesk.Revit.DB.Visual Namespace